---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.GetPresureDropItems
source: html/64c763c1-c558-88f8-1330-12c0c9f215f8.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.GetPresureDropItems Method

Returns the pressure drop items

## Syntax (C#)
```csharp
public IList<PipeFittingAndAccessoryPressureDropItem> GetPresureDropItems()
```